;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.4.LTS *
;* Date/Time created: Mon Oct 02 10:10:15 2017                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../source/DCT_REG.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.4.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\DenisS\Desktop\FIR_filter_offline\FIR_filter_offline\Debug")
;	C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_15.12.4.LTS\bin\ac2000.exe -@C:\\Users\\DenisS\\AppData\\Local\\Temp\\0326412 
	.sect	"ramfuncs:_DCT_REG_CALC"
	.clink
	.global	_DCT_REG_CALC

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("DCT_REG_CALC")
	.dwattr $C$DW$1, DW_AT_low_pc(_DCT_REG_CALC)
	.dwattr $C$DW$1, DW_AT_high_pc(0x00)
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_DCT_REG_CALC")
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_TI_begin_file("../source/DCT_REG.c")
	.dwattr $C$DW$1, DW_AT_TI_begin_line(0x19)
	.dwattr $C$DW$1, DW_AT_TI_begin_column(0x06)

; 139 | // omejim izhod                                                        
;----------------------------------------------------------------------
        MOVL      XAR4,#836             ; [CPU_U] |129| 
        MOVL      ACC,XAR4              ; [CPU_] |129| 
        MOVL      XAR4,#837             ; [CPU_U] |129| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |129| 
        MOVL      XAR7,ACC              ; [CPU_] |129| 
        MOVL      ACC,XAR4              ; [CPU_] |129| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |129| 
        MOVL      XAR4,ACC              ; [CPU_] |129| 
        MOV       AL,*XAR7              ; [CPU_] |129| 
        MOV       *+XAR4[0],AL          ; [CPU_] |129| 
$C$L13:    
	.dwpsn	file "../source/DCT_REG.c",line 140,column 5,is_stmt,isa 0
;----------------------------------------------------------------------
; 140 | v->Out = (v->Out > v->OutMax)? v->OutMax: v->Out;                      
;----------------------------------------------------------------------
        MOVL      XAR4,#826             ; [CPU_U] |140| 
        MOVL      ACC,XAR4              ; [CPU_] |140| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |140| 
        MOVL      XAR4,ACC              ; [CPU_] |140| 
        MOV32     R0H,*+XAR4[0]         ; [CPU_] |140| 
        MOVL      XAR4,#842             ; [CPU_U] |140| 
        MOVL      ACC,XAR4              ; [CPU_] |140| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |140| 
        MOVL      XAR4,ACC              ; [CPU_] |140| 
        MOV32     R1H,*+XAR4[0]         ; [CPU_] |140| 
        CMPF32    R1H,R0H               ; [CPU_] |140| 
        MOVST0    ZF, NF                ; [CPU_] |140| 
        B         $C$L14,LEQ            ; [CPU_] |140| 
        ; branchcc occurs ; [] |140| 
        MOVL      XAR4,#826             ; [CPU_U] |140| 
        MOVL      ACC,XAR4              ; [CPU_] |140| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |140| 
        MOVL      XAR4,ACC              ; [CPU_] |140| 
        MOVL      XAR6,*+XAR4[0]        ; [CPU_] |140| 
        B         $C$L15,UNC            ; [CPU_] |140| 
        ; branch occurs ; [] |140| 
$C$L14:    
        MOVL      XAR4,#842             ; [CPU_U] |140| 
        MOVL      ACC,XAR4              ; [CPU_] |140| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |140| 
        MOVL      XAR4,ACC              ; [CPU_] |140| 
        MOVL      XAR6,*+XAR4[0]        ; [CPU_] |140| 
$C$L15:    
        MOVL      XAR4,#842             ; [CPU_U] |140| 
        MOVL      ACC,XAR4              ; [CPU_] |140| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |140| 
        MOVL      XAR4,ACC              ; [CPU_] |140| 
        MOVL      *+XAR4[0],XAR6        ; [CPU_] |140| 
	.dwpsn	file "../source/DCT_REG.c",line 141,column 5,is_stmt,isa 0
;----------------------------------------------------------------------
; 141 | v->Out = (v->Out < v->OutMin)? v->OutMin: v->Out;                      
;----------------------------------------------------------------------
        MOVL      XAR4,#828             ; [CPU_U] |141| 
        MOVL      ACC,XAR4              ; [CPU_] |141| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |141| 
        MOVL      XAR4,ACC              ; [CPU_] |141| 
        MOV32     R0H,*+XAR4[0]         ; [CPU_] |141| 
        MOVL      XAR4,#842             ; [CPU_U] |141| 
        MOVL      ACC,XAR4              ; [CPU_] |141| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |141| 
        MOVL      XAR4,ACC              ; [CPU_] |141| 
        MOV32     R1H,*+XAR4[0]         ; [CPU_] |141| 
        CMPF32    R1H,R0H               ; [CPU_] |141| 
        MOVST0    ZF, NF                ; [CPU_] |141| 
        B         $C$L16,GEQ            ; [CPU_] |141| 
        ; branchcc occurs ; [] |141| 
        MOVL      XAR4,#828             ; [CPU_U] |141| 
        MOVL      ACC,XAR4              ; [CPU_] |141| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |141| 
        MOVL      XAR4,ACC              ; [CPU_] |141| 
        MOVL      XAR6,*+XAR4[0]        ; [CPU_] |141| 
        B         $C$L17,UNC            ; [CPU_] |141| 
        ; branch occurs ; [] |141| 
$C$L16:    
        MOVL      XAR4,#842             ; [CPU_U] |141| 
        MOVL      ACC,XAR4              ; [CPU_] |141| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |141| 
        MOVL      XAR4,ACC              ; [CPU_] |141| 
        MOVL      XAR6,*+XAR4[0]        ; [CPU_] |141| 
$C$L17:    
        MOVL      XAR4,#842             ; [CPU_U] |141| 
        MOVL      ACC,XAR4              ; [CPU_] |141| 
        ADDL      ACC,*-SP[4]           ; [CPU_] |141| 
        MOVL      XAR4,ACC              ; [CPU_] |141| 
        MOVL      *+XAR4[0],XAR6        ; [CPU_] |141| 
	.dwpsn	file "../source/DCT_REG.c",line 146,column 1,is_stmt,isa 0
;----------------------------------------------------------------------
; 146 | } // konec funkcije                                                    
;----------------------------------------------------------------------
        SUBB      SP,#4                 ; [CPU_U] 
	.dwcfi	cfa_offset, -2
$C$DW$4	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$4, DW_AT_low_pc(0x00)
	.dwattr $C$DW$4, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$1, DW_AT_TI_end_file("../source/DCT_REG.c")
	.dwattr $C$DW$1, DW_AT_TI_end_line(0x92)
	.dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$1


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("DCT_REG_FLOAT_STRUCT")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x66c)
$C$DW$5	.dwtag  DW_TAG_member
	.dwattr $C$DW$5, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$5, DW_AT_name("SamplingSignal")
	.dwattr $C$DW$5, DW_AT_TI_symbol_name("_SamplingSignal")
	.dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$6	.dwtag  DW_TAG_member
	.dwattr $C$DW$6, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$6, DW_AT_name("Ref")
	.dwattr $C$DW$6, DW_AT_TI_symbol_name("_Ref")
	.dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$7	.dwtag  DW_TAG_member
	.dwattr $C$DW$7, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$7, DW_AT_name("Fdb")
	.dwattr $C$DW$7, DW_AT_TI_symbol_name("_Fdb")
	.dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$8	.dwtag  DW_TAG_member
	.dwattr $C$DW$8, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$8, DW_AT_name("BufferHistoryLength")
	.dwattr $C$DW$8, DW_AT_TI_symbol_name("_BufferHistoryLength")
	.dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$9	.dwtag  DW_TAG_member
	.dwattr $C$DW$9, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$9, DW_AT_name("Kdct")
	.dwattr $C$DW$9, DW_AT_TI_symbol_name("_Kdct")
	.dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$10	.dwtag  DW_TAG_member
	.dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$10, DW_AT_name("Harmonics")
	.dwattr $C$DW$10, DW_AT_TI_symbol_name("_Harmonics")
	.dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$11	.dwtag  DW_TAG_member
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$11, DW_AT_name("FIRCoeff")
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("_FIRCoeff")
	.dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$12	.dwtag  DW_TAG_member
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$12, DW_AT_name("k")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_k")
	.dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x334]
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$13, DW_AT_name("ErrSumMax")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_ErrSumMax")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x336]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$14, DW_AT_name("ErrSumMin")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_ErrSumMin")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x338]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$15, DW_AT_name("OutMax")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_OutMax")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x33a]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$16, DW_AT_name("OutMin")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_OutMin")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x33c]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$17, DW_AT_name("Err")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_Err")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x33e]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$18, DW_AT_name("ErrSum")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_ErrSum")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x340]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$19, DW_AT_name("Correction")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_Correction")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x342]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$20, DW_AT_name("i")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_i")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x344]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$21, DW_AT_name("i_prev")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_i_prev")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x345]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$22, DW_AT_name("index")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_index")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x346]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$23	.dwtag  DW_TAG_member
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$23, DW_AT_name("j")
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_j")
	.dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x347]
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$24, DW_AT_name("CircularBufferIndex")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_CircularBufferIndex")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x348]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$25, DW_AT_name("Out")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_Out")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x34a]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$26, DW_AT_name("ErrSumHistory")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_ErrSumHistory")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x34c]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$21

$C$DW$T$22	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$22, DW_AT_name("DCT_REG_float")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)

$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)


$C$DW$T$19	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x0a)
$C$DW$27	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$27, DW_AT_upper_bound(0x09)

	.dwendtag $C$DW$T$19

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)


$C$DW$T$20	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x320)
$C$DW$28	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$28, DW_AT_upper_bound(0x18f)

	.dwendtag $C$DW$T$20

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)

	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
