;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.4.LTS *
;* Date/Time created: Mon Oct 02 10:10:16 2017                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../source/DLOG_gen.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.4.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\DenisS\Desktop\FIR_filter_offline\FIR_filter_offline\Debug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-$C$IR_1,16
	.field  	_dlog+0,32
	.bits	0,32			; _dlog._trig @ 0
	.bits	0,32			; _dlog._iptr1 @ 32
	.bits	0,32			; _dlog._iptr2 @ 64
	.bits	0,32			; _dlog._iptr3 @ 96
	.bits	0,32			; _dlog._iptr4 @ 128
	.bits	0,32			; _dlog._iptr5 @ 160
	.bits	0,32			; _dlog._iptr6 @ 192
	.bits	0,32			; _dlog._iptr7 @ 224
	.bits	0,32			; _dlog._iptr8 @ 256

	.dwpsn	file "../source/DLOG_gen.c",line 288,column 21,is_stmt,isa 0
;----------------------------------------------------------------------
; 288 | dlog.state = Holdoff;                                                  
;----------------------------------------------------------------------
        MOVB      @_dlog+24,#3,UNC      ; [CPU_] |288| 
	.dwpsn	file "../source/DLOG_gen.c",line 289,column 21,is_stmt,isa 0
;----------------------------------------------------------------------
; 289 | dlog.holdoff_cnt = 0;                                                  
;----------------------------------------------------------------------
        MOVB      ACC,#0                ; [CPU_] |289| 
        MOVL      @_dlog+32,ACC         ; [CPU_] |289| 
	.dwpsn	file "../source/DLOG_gen.c",line 290,column 17,is_stmt,isa 0
;----------------------------------------------------------------------
; 291 | // ustavim v primeru single - shota                                    
; 292 | else                                                                   
;----------------------------------------------------------------------
        B         $C$L13,UNC            ; [CPU_] |290| 
        ; branch occurs ; [] |290| 
$C$L12:    
	.dwpsn	file "../source/DLOG_gen.c",line 294,column 21,is_stmt,isa 0
;----------------------------------------------------------------------
; 294 | dlog.mode = Stop;                                                      
;----------------------------------------------------------------------
        MOVB      @_dlog+34,#3,UNC      ; [CPU_] |294| 
	.dwpsn	file "../source/DLOG_gen.c",line 295,column 21,is_stmt,isa 0
;----------------------------------------------------------------------
; 295 | dlog.state = Wait;                                                     
; 300 | // za downsamplanje                                                    
;----------------------------------------------------------------------
        MOV       @_dlog+24,#0          ; [CPU_] |295| 
$C$L13:    
	.dwpsn	file "../source/DLOG_gen.c",line 301,column 9,is_stmt,isa 0
;----------------------------------------------------------------------
; 301 | (dlog.skip_cntr)++;                                                    
;----------------------------------------------------------------------
        INC       @_dlog+21             ; [CPU_] |301| 
	.dwpsn	file "../source/DLOG_gen.c",line 302,column 9,is_stmt,isa 0
;----------------------------------------------------------------------
; 302 | if ((dlog.skip_cntr) >= (dlog.prescalar))                              
;----------------------------------------------------------------------
        MOV       AL,@_dlog+20          ; [CPU_] |302| 
        CMP       AL,@_dlog+21          ; [CPU_] |302| 
        B         $C$L14,HI             ; [CPU_] |302| 
        ; branchcc occurs ; [] |302| 
	.dwpsn	file "../source/DLOG_gen.c",line 304,column 13,is_stmt,isa 0
;----------------------------------------------------------------------
; 304 | dlog.skip_cntr = 0;                                                    
; 308 | // preden pripravim nov trigger pocakam                                
;----------------------------------------------------------------------
        MOV       @_dlog+21,#0          ; [CPU_] |304| 
$C$L14:    
	.dwpsn	file "../source/DLOG_gen.c",line 309,column 5,is_stmt,isa 0
;----------------------------------------------------------------------
; 309 | if (dlog.state == Holdoff)                                             
;----------------------------------------------------------------------
        MOV       AL,@_dlog+24          ; [CPU_] |309| 
        CMPB      AL,#3                 ; [CPU_] |309| 
        B         $C$L15,NEQ            ; [CPU_] |309| 
        ; branchcc occurs ; [] |309| 
	.dwpsn	file "../source/DLOG_gen.c",line 311,column 9,is_stmt,isa 0
;----------------------------------------------------------------------
; 311 | dlog.holdoff_cnt = dlog.holdoff_cnt + 1;                               
;----------------------------------------------------------------------
        MOVB      ACC,#1                ; [CPU_] |311| 
        ADDL      @_dlog+32,ACC         ; [CPU_] |311| 
	.dwpsn	file "../source/DLOG_gen.c",line 312,column 9,is_stmt,isa 0
;----------------------------------------------------------------------
; 312 | if (dlog.holdoff_cnt == dlog.holdoff_time)                             
;----------------------------------------------------------------------
        MOVL      ACC,@_dlog+30         ; [CPU_] |312| 
        CMPL      ACC,@_dlog+32         ; [CPU_] |312| 
        B         $C$L15,NEQ            ; [CPU_] |312| 
        ; branchcc occurs ; [] |312| 
	.dwpsn	file "../source/DLOG_gen.c",line 314,column 13,is_stmt,isa 0
;----------------------------------------------------------------------
; 314 | dlog.state = Wait;                                                     
;----------------------------------------------------------------------
        MOV       @_dlog+24,#0          ; [CPU_] |314| 
	.dwpsn	file "../source/DLOG_gen.c",line 318,column 1,is_stmt,isa 0
$C$L15:    
        SUBB      SP,#2                 ; [CPU_U] 
	.dwcfi	cfa_offset, -2
$C$DW$11	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$11, DW_AT_low_pc(0x00)
	.dwattr $C$DW$11, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$10, DW_AT_TI_end_file("../source/DLOG_gen.c")
	.dwattr $C$DW$10, DW_AT_TI_end_line(0x13e)
	.dwattr $C$DW$10, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$10


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name("DLOG")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x24)
$C$DW$12	.dwtag  DW_TAG_member
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$12, DW_AT_name("trig")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_trig")
	.dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$13, DW_AT_name("iptr1")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_iptr1")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$14, DW_AT_name("iptr2")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_iptr2")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$15, DW_AT_name("iptr3")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_iptr3")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$16, DW_AT_name("iptr4")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_iptr4")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$17, DW_AT_name("iptr5")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_iptr5")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$18, DW_AT_name("iptr6")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_iptr6")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$19, DW_AT_name("iptr7")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_iptr7")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$20, DW_AT_name("iptr8")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_iptr8")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$21, DW_AT_name("trig_value")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_trig_value")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$22, DW_AT_name("prescalar")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_prescalar")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$23	.dwtag  DW_TAG_member
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$23, DW_AT_name("skip_cntr")
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_skip_cntr")
	.dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$24, DW_AT_name("write_ptr")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_write_ptr")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$25, DW_AT_name("write_length")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_write_length")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$26, DW_AT_name("state")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_state")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$27, DW_AT_name("slope")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("_slope")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$28, DW_AT_name("auto_time")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("_auto_time")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$29, DW_AT_name("auto_cnt")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("_auto_cnt")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$30, DW_AT_name("holdoff_time")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("_holdoff_time")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$31, DW_AT_name("holdoff_cnt")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("_holdoff_cnt")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$32, DW_AT_name("mode")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("_mode")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$33, DW_AT_name("sw_trigger")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("_sw_trigger")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$23


$C$DW$T$22	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$22, DW_AT_name("DLOG_MODE")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
$C$DW$34	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$34, DW_AT_name("Auto")
	.dwattr $C$DW$34, DW_AT_const_value(0x00)

$C$DW$35	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$35, DW_AT_name("Normal")
	.dwattr $C$DW$35, DW_AT_const_value(0x01)

$C$DW$36	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$36, DW_AT_name("Single")
	.dwattr $C$DW$36, DW_AT_const_value(0x02)

$C$DW$37	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$37, DW_AT_name("Stop")
	.dwattr $C$DW$37, DW_AT_const_value(0x03)

$C$DW$38	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$38, DW_AT_name("Continuous")
	.dwattr $C$DW$38, DW_AT_const_value(0x04)

	.dwendtag $C$DW$T$22


$C$DW$T$21	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$21, DW_AT_name("DLOG_SLOPE")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$39	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$39, DW_AT_name("Positive")
	.dwattr $C$DW$39, DW_AT_const_value(0x00)

$C$DW$40	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$40, DW_AT_name("Negative")
	.dwattr $C$DW$40, DW_AT_const_value(0x01)

	.dwendtag $C$DW$T$21


$C$DW$T$20	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$20, DW_AT_name("DLOG_STATE")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
$C$DW$41	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$41, DW_AT_name("Wait")
	.dwattr $C$DW$41, DW_AT_const_value(0x00)

$C$DW$42	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$42, DW_AT_name("Ready")
	.dwattr $C$DW$42, DW_AT_const_value(0x01)

$C$DW$43	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$43, DW_AT_name("Store")
	.dwattr $C$DW$43, DW_AT_const_value(0x02)

$C$DW$44	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$44, DW_AT_name("Holdoff")
	.dwattr $C$DW$44, DW_AT_const_value(0x03)

	.dwendtag $C$DW$T$20

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
